In [1]:
#Q1
import pandas as pd
data = {"a":[1,2,3,4],
       "b":[4,5,6,7],
       "c":["Parul" , "satish","shiv","pushpa"]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7   navin

In [7]:
df['a'].mean()

2.5

In [8]:
df['a'].mode()

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [9]:
df['a'].median()

2.5

In [10]:
df['a'].max()

4

In [11]:
df['a'].min()

1

In [ ]:
#Q2
import pandas as pd
data1 = {"A":[1,2,3,4],
       "B":[4,5,6,7],
       "c":["Parul" , "satish","shiv","pushpa"]}

In [21]:
df1 = pd.DataFrame(data1)

In [22]:
df1

   A  B       c
0  1  4   Parul
1  2  5  satish
2  3  6    shiv
3  4  7  pushpa

In [27]:
len(df1)

4

In [23]:

df1.reindex([1,3,5,])

     A    B       c
1  2.0  5.0  satish
3  4.0  7.0  pushpa
5  NaN  NaN     NaN

In [25]:
#another method
new_index = pd.RangeIndex(start=1, step=2, stop=2*len(df1)+1)
df2= df1.set_index(new_index)

In [26]:
df2

   A  B       c
1  1  4   Parul
3  2  5  satish
5  3  6    shiv
7  4  7  pushpa

In [28]:
#Q3
data2={'values' : [10, 20, 30, 40, 50]}
df3 = pd.DataFrame(data2)

In [29]:
df3

   values
0      10
1      20
2      30
3      40
4      50

In [37]:
df3[0:3] .sum()

values    60
dtype: int64

In [39]:
#Q4
data5 =  {"Text":["My name is Parul" , "My husband name is satish","I have only son whose name is shiv","My mother name is pushpa Sharma"]}
df4 = pd.DataFrame(data5)

In [40]:
df4

                                 Text
0                    My name is Parul
1           My husband name is satish
2  I have only son whose name is shiv
3     My mother name is pushpa Sharma

In [42]:
df4["Word_Count"] =  df4['Text'].apply(lambda x: len(x.split()))

In [43]:
df4

                                 Text  Word_Count
0                    My name is Parul           4
1           My husband name is satish           5
2  I have only son whose name is shiv           8
3     My mother name is pushpa Sharma           6

In [ ]:
# #Q5
# DataFrame.size() returns the total number of elements in the DataFrame. This is equivalent to the product of the number of rows and the number of columns in the DataFrame. For example, if a DataFrame has 4 rows and 3 columns, then its size is 12.

# DataFrame.shape() returns a tuple that contains the number of rows and columns in the DataFrame, respectively. For example, if a DataFrame has 4 rows and 3 columns, then its shape is (4, 3).

In [ ]:
#Q6
#df1 = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

In [44]:
#Q7
data6 = {'Email' : ['parul@gmail.com' , "satish@gmail.com","shiv@gmail.com","pushpa@gmail.com"]}
df = pd.DataFrame(data6)

In [45]:
df

              Email
0   parul@gmail.com
1  satish@gmail.com
2    shiv@gmail.com
3  pushpa@gmail.com

In [53]:
  df["Username"] =  df['Email'].apply(lambda x: (x.split('@')[0]))

In [54]:
df

              Email Username
0   parul@gmail.com    parul
1  satish@gmail.com   satish
2    shiv@gmail.com     shiv
3  pushpa@gmail.com   pushpa

In [64]:
#Q8
data1 = {"A":[3,8,6,2,9],
       "B":[5,2,9,3,1],
       "c":[1,7,4,5,2]}
df = pd.DataFrame(data1)

In [65]:
df

   A  B  c
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [66]:
df[(df['A']>5) & (df['B']<10)]

   A  B  c
1  8  2  7
2  6  9  4
4  9  1  2

In [67]:
#Q9
data2={'values' : [10, 20, 30, 40, 50]}
df3 = pd.DataFrame(data2)

In [68]:
df3

   values
0      10
1      20
2      30
3      40
4      50

In [69]:
df3.mean()

values    30.0
dtype: float64

In [70]:
df3.median()

values    30.0
dtype: float64

In [71]:
df3.std()

values    15.811388
dtype: float64

In [78]:
#Q10

df = pd.DataFrame({'Date': ['2023-04-01', '2023-04-02', '2023-04-03', '2023-04-04', '2023-04-05',
                            '2023-04-06', '2023-04-07', '2023-04-08', '2023-04-09', '2023-04-10'],
                   'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]})

df['MovingAverage'] = df['Sales'].rolling(window=7).mean()

In [79]:
df

         Date  Sales  MovingAverage
0  2023-04-01     10            NaN
1  2023-04-02     20            NaN
2  2023-04-03     30            NaN
3  2023-04-04     40            NaN
4  2023-04-05     50            NaN
5  2023-04-06     60            NaN
6  2023-04-07     70           40.0
7  2023-04-08     80           50.0
8  2023-04-09     90           60.0
9  2023-04-10    100           70.0

In [114]:
#Q10
import pandas as pd
date = pd.date_range(start='2023-04-23' , end = '2023-04-30')

In [115]:
date

DatetimeIndex(['2023-04-23', '2023-04-24', '2023-04-25', '2023-04-26',
               '2023-04-27', '2023-04-28', '2023-04-29', '2023-04-30'],
              dtype='datetime64[ns]', freq='D')

In [116]:
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-04-23
1 2023-04-24
2 2023-04-25
3 2023-04-26
4 2023-04-27
5 2023-04-28
6 2023-04-29
7 2023-04-30

In [119]:
df['Weekday'] = df['Date'].dt.weekday_name

AttributeError: 'DatetimeProperties' object has no attribute 'weekday_name'

In [118]:
df

        Date
0 2023-04-23
1 2023-04-24
2 2023-04-25
3 2023-04-26
4 2023-04-27
5 2023-04-28
6 2023-04-29
7 2023-04-30

In [ ]:
#Q13
#To use the basic functions of pandas, the first and foremost necessary library that needs to be imported is pandas itself.

In [ ]:
#12
df[(df['Date']>='2023-01-01') & (df['Date']<'2023-01-31')]